Thanks for opening this issue @linefeedse :)

I created a deployment with the values you specified and the deployment was created successfully.

```console
$ terraform version
Terraform v0.14.7

$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding elastic/ec versions matching "0.1.0-beta"...
- Installing elastic/ec v0.1.0-beta...
- Installed elastic/ec v0.1.0-beta (unauthenticated)

<...>

Terraform has been successfully initialized!
<...>
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ec_deployment.example_minimal will be created
  + resource "ec_deployment" "example_minimal" {
      + apm_secret_token       = (sensitive value)
      + deployment_template_id = "aws-io-optimized-v2"
      + elasticsearch_password = (sensitive value)
      + elasticsearch_username = (known after apply)
      + id                     = (known after apply)
      + name                   = "my_example_deployment"
      + region                 = "us-east-1"
      + version                = "7.9.2"

      + apm {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-apm"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)
          + version                      = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }

      + elasticsearch {
          + cloud_id       = (known after apply)
          + http_endpoint  = (known after apply)
          + https_endpoint = (known after apply)
          + ref_id         = "main-elasticsearch"
          + region         = (known after apply)
          + resource_id    = (known after apply)
          + version        = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + node_type_data            = (known after apply)
              + node_type_ingest          = (known after apply)
              + node_type_master          = (known after apply)
              + node_type_ml              = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }

      + enterprise_search {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-enterprise_search"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)
          + version                      = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + node_type_appserver       = (known after apply)
              + node_type_connector       = (known after apply)
              + node_type_worker          = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }

      + kibana {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-kibana"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)
          + version                      = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + deployment_id                = (known after apply)
  + elasticsearch_cloud_id       = (known after apply)
  + elasticsearch_https_endpoint = (known after apply)
  + elasticsearch_password       = (known after apply)
  + elasticsearch_username       = (known after apply)
  + elasticsearch_version        = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ec_deployment.example_minimal: Creating...
<...>
ec_deployment.example_minimal: Creation complete after 5m41s [id=<deployment-id>]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Did you import your other deployment into the same directory by any chance? Terraform might be trying to apply a change rather than creating a new resource.